controllers/WorkerController.php

    public function actionNewworker()
    {

       $model = new Worker();

       $model_project = new Project();

       $model_workerproject = new Workerproject();

        if($model->load(\Yii::$app->request->post()) && $model->validate()) {

          $model->name = Yii::$app->request->post('Worker')['name'];
          $session = Yii::$app->session;
          $model->photo = $session->get('photo');
          $model->sociability = Yii::$app->request->post('Worker')['sociability'];
          $model->engineering = Yii::$app->request->post('Worker')['engineering'];
          $model->timemanagement = Yii::$app->request->post('Worker')['timemanagement'];
          $model->languages = Yii::$app->request->post('Worker')['languages'];
          $model->insert();

          $id_add_item = $model->find()->max('id');
---
INSERT INTO `worker` (`name`, `photo`, `sociability`, `engineering`, `timemanagement`, `languages`) VALUES ('lena', 'img/20180912143823151_0300.jpg', 0, 0, 0, 0)
SELECT MAX(id) FROM `worker`

    public function actionListworkers($search = '')
    {

       $model = new Worker();

       $list = $model->find()
          ->select(['{{worker}}.[[id]]', '{{worker}}.[[name]]', '[[photo]]', '[[sociability]]', '[[engineering]]', '[[timemanagement]]', '[[languages]]', '{{project}}.[[name]] as name_project', 'count({{workerproject}}.[[id_worker]]) as result'])
          ->leftJoin('{{workerproject}}', '{{workerproject}}.[[id_worker]] = {{worker}}.[[id]]')
          ->leftJoin('{{project}}', '{{project}}.[[id]] = {{workerproject}}.[[id_project]]')
          ->where(['like', '{{worker}}.[[name]]', $search])
          ->groupBy('{{worker}}.[[id]]')
          ->asArray()
          ->all();

      $average = $model->find()
          ->select(['round(sum([[sociability]])/count(*),2) as average_sociability', 'round(sum([[engineering]])/count(*),2) as average_engineering', 'round(sum([[timemanagement]])/count(*),2) as average_timemanagement', 'round(sum([[languages]])/count(*),2) as average_languages'])
          ->asArray()
          ->all();
---
SELECT `worker`.`id`, `worker`.`name`, `photo`, `sociability`, `engineering`, `timemanagement`, `languages`, `project`.`name` AS `name_project`, count(`workerproject`.`id_worker`) as result FROM `worker` LEFT JOIN `workerproject` ON `workerproject`.`id_worker` = `worker`.`id` LEFT JOIN `project` ON `project`.`id` = `workerproject`.`id_project` WHERE `worker`.`name` LIKE '%%' GROUP BY `worker`.`id`
SELECT round(sum(`sociability`)/count(*),2) as average_sociability, round(sum(`engineering`)/count(*),2) as average_engineering, round(sum(`timemanagement`)/count(*),2) as average_timemanagement, round(sum(`languages`)/count(*),2) as average_languages FROM `worker`

    public function actionRemoveworker($id, $photo)
    {
       $model = new Worker();

       $model_workerproject = new Workerproject();

       $model->findOne($id)->delete();

       $model_workerproject->deleteAll('id_worker = :id_worker', [':id_worker' => $id]);
---
DELETE FROM `worker` WHERE `id`=91
SELECT * FROM `worker` WHERE `id`='91'
DELETE FROM `workerproject` WHERE id_worker = '91'